bench/results/rust-axum/v3-20260523-113610-rust-axum/warmup-read.txt
Running 10s test @ http://localhost:3001
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.54ms  599.35us  18.70ms   80.54%
    Req/Sec     3.94k   441.82     4.76k    62.00%
  317167 requests in 10.10s, 74.74MB read
Requests/sec:  31403.37
Transfer/sec:      7.40MB